tutorials/multiphase/cavitatingFoam/LES/throttle3D/system/refineMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      refineMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

set             c0;

coordinateSystem global;

globalCoeffs
{
    e1              (1 0 0);
    e2              (0 1 0);
    e3              (0 0 1);
}

directions      (e1 e2 e3);

useHexTopology  yes;

geometricCut    no;

writeMesh       no;


// ************************************************************************* //
